# TrussBearingChordTopBottomParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..TrussBearingChordTopBottomParam Property
ParameterTypeId Class See Also
---
"Bearing Chord"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId TrussBearingChordTopBottomParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TrussBearingChordTopBottomParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ TrussBearingChordTopBottomParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace